# Using Data Frame for converting Dictionaries to  Data frame

In [14]:
import pandas as pd
dict = {"FirstName": ["Pavan", "Jaya", "Gopi"],
        "LastName": ["Kumar", "Ram", ""],
        "Age": [24, 25, 26]}
df = pd.DataFrame(dict)
df

  FirstName LastName  Age
0     Pavan    Kumar   24
1      Jaya      Ram   25
2      Gopi            26

In [15]:
df["Age"]

0    24
1    25
2    26
Name: Age, dtype: int64

In [16]:
df.Age

0    24
1    25
2    26
Name: Age, dtype: int64

In [17]:
df[["FirstName", "Age"]]

  FirstName  Age
0     Pavan   24
1      Jaya   25
2      Gopi   26

In [18]:
df.columns

Index(['FirstName', 'LastName', 'Age'], dtype='object')

In [19]:
df.iloc[[0,1],[0,2]] #Rows , Column index

  FirstName  Age
0     Pavan   24
1      Jaya   25

In [20]:
df.loc[[0,1],['Age','FirstName']] #Row name, column name

   Age FirstName
0   24     Pavan
1   25      Jaya

In [21]:
df.set_index("Age") #This won't change the data

    FirstName LastName
Age
24      Pavan    Kumar
25       Jaya      Ram
26       Gopi

In [22]:
df.set_index("Age",inplace=True) #This will change the data in dataframe
df

    FirstName LastName
Age
24      Pavan    Kumar
25       Jaya      Ram
26       Gopi

In [26]:
df.loc[24]

FirstName    Pavan
LastName     Kumar
Name: 24, dtype: object

In [28]:
df.reset_index(inplace=True)
df

   Age FirstName LastName
0   24     Pavan    Kumar
1   25      Jaya      Ram
2   26      Gopi